content/posts/getting_things_done.md
+++
title = "Getting Things Done (GTD)"
author = ["Jethro Kuan"]
draft = false
+++

[GTD](https://gettingthingsdone.com/) is a work-life management system created by David Allen. This
[productivity]({{<relref "productivity.md#" >}}) is summarized nicely in [this article](https://hamberg.no/gtd/).


## Org-mode {#org-mode}

[Org-Mode]({{<relref "org-mode.md#" >}}) has first-class support for this technique. There are several
people who have documented their GTD workflow using [Org-Mode]({{<relref "org-mode.md#" >}}). Here is
a list:

-   [Org Mode - Organize Your Life In Plain Text!](http://doc.norang.ca/org-mode.html) ⭐
-   [Org-mode Workflow: A Preview - Jethro Kuan](https://blog.jethro.dev/posts/org%5Fmode%5Fworkflow%5Fpreview/) ⭐